Revit 2027 API
GeometryObject.Equality Operator
Determines whether two GeometryObjects are the same.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator ==(
	GeometryObject first,
	GeometryObject second
)
Public Shared Operator = (
	first As GeometryObject,
	second As GeometryObject
) As Boolean
public:
static bool operator ==(
	GeometryObject^ first,
	GeometryObject^ second
)
static let inline (=)
        first : GeometryObject *
        second : GeometryObject  : bool
Parameters
first GeometryObject
The first GeometryObject.
second GeometryObject
The second GeometryObject.
Return Value
Boolean
True if the GeometryObjects are the same; otherwise, false.
Remarks
This compares the internal identifiers of the geometry, and doesn't compare them geometrically.
See Also
Reference
GeometryObject Class
Autodesk.Revit.DB Namespace